bit-finance/DataProcessors/бит_ДополнительнаяИнформация.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ДополнительнаяИнформация</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

bit-finance/InformationRegisters/бит_НастройкиПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НастройкиПользователей</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗначениеНастройки</Name>
					<Comment>Значение настройки</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_НастройкиПользователей</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Настройка</Name>
					<Comment>Настройка</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_НастройкиПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/DataProcessors/бит_ДополнительнаяИнформация/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

// Хранит признак того, что форму обработки нужно открывать при запуске системы для текущего пользователя.
&НаКлиенте
Перем мПервоначальноеЗначениеПоказывать;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);
	
	КоллекцияМакетов = Метаданные.Обработки.бит_ДополнительнаяИнформация.Макеты;
	Если КоллекцияМакетов.Количество() = 0 Тогда
		фОтказ = Истина;
		Возврат;
	КонецЕсли;
	
	фСодержаниеСформировано = Ложь;
	          	
	// Получим значение признака необходимости открывать форму при начале работы системы 
	// для текущего пользователя.
	фТекущийПользователь      = Пользователи.ТекущийПользователь(); 	
	ПоказыватьПриНачалеРаботы = бит_УправлениеПользователямиСервер.ПолучитьНастройкуПользователя("ПоказыватьДополнительнуюИнформациюБит", фТекущийПользователь);

	ТекОбработка  = РеквизитФормыВЗначение("Объект");
	   		
	// Покажем первый макет в поле HTML документа.
	мТекущийМакет 	  = ТекОбработка.ПолучитьМакет("Главная");
	
	ТекстХТМЛ = мТекущийМакет.ПолучитьТекст();
	
	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_БаннерКурсы, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%src%", СсылкаКартинки);
	
	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_БаннерМобПриложение, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%srcMob%", СсылкаКартинки);

	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_QRcodeApprovalServiceAppStore, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%QRcodeApprovalServiceAppStore%", СсылкаКартинки);

	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_QRcodeApprovalServiceGooglePlay, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%QRcodeApprovalServiceGooglePlay%", СсылкаКартинки);

	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_QRcodeTelegramСообщество, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%QRcodeTelegramСообщество%", СсылкаКартинки);

	СсылкаКартинки = ПоместитьВоВременноеХранилище(БиблиотекаКартинок.бит_QRcodeTelegramAIBot, УникальныйИдентификатор);
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%QRcodeTelegramAIBot%", СсылкаКартинки);
	
	ПолеHTMLДокумента = ТекстХТМЛ;
			
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если фОтказ Тогда	
		Отказ = Истина;
		Возврат; 	
	КонецЕсли;
	    			
	// Сохраняем первоначальное значение признака необходимости открывать форму при начале работы системы 
	// для текущего пользователя.
	мПервоначальноеЗначениеПоказывать = ПоказыватьПриНачалеРаботы;
		   	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЗавершениеРаботы Тогда
	    Возврат;	
	КонецЕсли; 
	
	Если мПервоначальноеЗначениеПоказывать <> ПоказыватьПриНачалеРаботы Тогда		
		ПриЗакрытииСервер(); 		  	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПолеHTMLДокументаПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	
	Если ДанныеСобытия.Свойство("href") Тогда
		
		СтандартнаяОбработка = Ложь;
		ИмяОткрываемойСтраницы = ДанныеСобытия.href;
		Если ИмяОткрываемойСтраницы <> Неопределено Тогда
			ФайловаяСистемаКлиент.ОткрытьНавигационнуюСсылку(ИмяОткрываемойСтраницы)
		КонецЕсли;       		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПерейтиНаГлавную(Команда)
	
	ПерейтиНаГлавнуюСтраницу();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура выполняет действия на сервере, необходимые при закрытии формы.
//
&НаСервере
Процедура ПриЗакрытииСервер()
	
	Настройка = ПланыВидовХарактеристик.бит_НастройкиПользователей.ПоказыватьДополнительнуюИнформациюБит;
	
	НаборЗаписей = РегистрыСведений.бит_НастройкиПользователей.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Пользователь.Установить(фТекущийПользователь);
	НаборЗаписей.Отбор.Настройка.Установить(Настройка);
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Запись = НаборЗаписей.Добавить();
	Запись.Пользователь 	 = фТекущийПользователь;
	Запись.Настройка 		 = Настройка;
	Запись.ЗначениеНастройки = ПоказыватьПриНачалеРаботы;
	
	НаборЗаписей.Записать();
		
КонецПроцедуры

&НаСервере
Процедура ПерейтиНаГлавнуюСтраницу()
	              	 
	ТекОбработка  = РеквизитФормыВЗначение("Объект");
	мТекущийМакет = ТекОбработка.ПолучитьМакет("Главная");
	
	ТекстХТМЛ = мТекущийМакет.ПолучитьТекст();
	
	СсылкаКартинки = ПолучитьНавигационнуюСсылку(БиблиотекаКартинок.бит_БаннерКурсы);
	
	ТекстХТМЛ = СтрЗаменить(ТекстХТМЛ, "%src%", СсылкаКартинки);
	
	ПолеHTMLДокумента = ТекстХТМЛ;
	
КонецПроцедуры

#КонецОбласти
